In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\harun-ur-rashid\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\harun-ur-rashid\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\harun-ur-rashid\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in c:\users\harun-ur-rashid\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: six>=1.5 in c:\users\harun-ur-rashid\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)

### Dataframe Basic

In [1]:
import pandas as pd

In [2]:
weather_data = {
    'Day':['Saturday','Sunday','Monday','Tuesday'],
    'Temperature':[20,35,40,25],
    'Event':['Rain','Sunny','Sunny','Rain']
}

In [3]:
data = pd.DataFrame(weather_data)

In [4]:
data.head()

        Day  Temperature  Event
0  Saturday           20   Rain
1    Sunday           35  Sunny
2    Monday           40  Sunny
3   Tuesday           25   Rain

In [5]:
data.tail()

        Day  Temperature  Event
0  Saturday           20   Rain
1    Sunday           35  Sunny
2    Monday           40  Sunny
3   Tuesday           25   Rain

In [6]:
data.columns

Index(['Day', 'Temperature', 'Event'], dtype='object')

In [7]:
data.Day

0    Saturday
1      Sunday
2      Monday
3     Tuesday
Name: Day, dtype: object

In [8]:
type(data.Day)

pandas.core.series.Series

In [9]:
data[['Day','Temperature']]

        Day  Temperature
0  Saturday           20
1    Sunday           35
2    Monday           40
3   Tuesday           25

In [10]:
data.Day.max()

'Tuesday'

In [17]:
data[data['Temperature']>32]

      Day  Temperature  Event
1  Sunday           35  Sunny
2  Monday           40  Sunny

In [18]:
data['Temperature'].std()

9.128709291752768

In [19]:
data['Temperature'].mean()

30.0

In [20]:
data['Temperature'].mode()

0    20
1    25
2    35
3    40
dtype: int64

In [21]:
data.describe()

       Temperature
count     4.000000
mean     30.000000
std       9.128709
min      20.000000
25%      23.750000
50%      30.000000
75%      36.250000
max      40.000000

In [22]:
data.set_index('Day',inplace=True)

In [23]:
data

          Temperature  Event
Day
Saturday           20   Rain
Sunday             35  Sunny
Monday             40  Sunny
Tuesday            25   Rain

In [24]:
data.loc['Monday']

Temperature       40
Event          Sunny
Name: Monday, dtype: object

In [25]:
data.reset_index(inplace=True)

In [26]:
data

        Day  Temperature  Event
0  Saturday           20   Rain
1    Sunday           35  Sunny
2    Monday           40  Sunny
3   Tuesday           25   Rain

In [29]:
data.set_index('Event',inplace=True)

In [32]:
data

            Day  Temperature
Event
Rain   Saturday           20
Sunny    Sunday           35
Sunny    Monday           40
Rain    Tuesday           25

In [33]:
data.reset_index(inplace=True)

In [34]:
data

   Event       Day  Temperature
0   Rain  Saturday           20
1  Sunny    Sunday           35
2  Sunny    Monday           40
3   Rain   Tuesday           25

In [35]:
data.to_csv('weather_data.csv',index=False)

In [36]:
df = pd.read_csv('weather_data.csv')

In [37]:
df

   Event       Day  Temperature
0   Rain  Saturday           20
1  Sunny    Sunday           35
2  Sunny    Monday           40
3   Rain   Tuesday           25

In [38]:
data.to_excel('weather_data.xlsx','sheet1',index=False)

In [40]:
df1=pd.read_excel('weather_data.xlsx','sheet1')

In [41]:
df1

   Event       Day  Temperature
0   Rain  Saturday           20
1  Sunny    Sunday           35
2  Sunny    Monday           40
3   Rain   Tuesday           25

In [42]:
weather_data = [
    ('Monday',40,'Sunny'),
    ('Tuesday',25,'Rain'),
    ('Sunday',35,'Sunny')
]

In [43]:
data_tuple = pd.DataFrame(data=weather_data,columns=['Day','Temperature','Event'])
data_tuple

       Day  Temperature  Event
0   Monday           40  Sunny
1  Tuesday           25   Rain
2   Sunday           35  Sunny